pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/ADM/fluidizedBed/0.orig/RADM.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    object      RADM.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0 0 0 0);

boundaryField
{
    vin_DB
    {
		type               zeroGradient;
    }

    pout
    {
		type               zeroGradient;
    }

    w_FB
    {
		type               zeroGradient;
    }

}

// ************************************************************************* //
