pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/ADM/fluidizedBed/0.orig/U1star
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U1star;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -0.01);

boundaryField
{
    vin_DB
    {
		type               fixedValue;
		value              uniform (0 0 0);
    }

    pout
    {
		type               fixedValue;
		value              uniform (0 0 0);
    }

    w_FB
    {
		type               fixedValue;
		value              uniform (0 0 0);
    }
}

// ************************************************************************* //
